"use strict";
const name = prompt('Пожалуйста, представьтесь?');
if(name=="Эммануэль"){
    alert('Да я сегодня прекрасен как никогда, раз зашел на этот сайт)');
}    
if(name=="Анна"){
    alert('Как официально. Не уж то сама королева? Чтожж, Эммануэль вас пропускает)');
}    
if(name=="Аня"){
    alert('Аня-маня, рады вам всегда)');
}    
if(name=="Яна"){
    alert('Солнышко Ясик, мы ждали вас!!!');
}    
if(name=="Викторина Советкина"){
    alert('Не слишком ли официально, дамочка?))');
}
if(name=="Админ"){
    alert('Я, что-ли?');
    alert('Ну привет, я))');
}
if(name=="Александр"){
    alert('Оуу, вы проходите без очереди!');
}
if(name=="Мария"){
    alert('Привет, гномик :333');
}
if(name=="Ильнур"){
    alert('Ооооо, морковная любовь Виктории, как романтично...');
}
if(name=="Иля"){
    alert('Ты правда так написал?');
    alert('Мило...');
    alert('Я тебя люблю!!!');
}
if(name=="Вика"){
    alert(':)');
}
if (name) {
    alert(`${name}, добро пожаловать на сайт!`);
}
else {
    alert('Добро пожаловать на сайт, милашка ');
}
